--تمت كتابه الملف بواسطه المطور @iq_313k
--تمت الزخرفه بواسطه@IxXx_56_xXxI
do 

local function run(msg, matches) 

if matches[1]=="سمايل" and is_sudo(msg) then 

return   "نہٖعم حہٖحۘـﺒﻴۘﺒﻴـہۛ الہٖمہٖطہٖور┋🌝💗"

elseif matches[1]=="هلو" or matches[1]== "هلوو" or matches[1]=="هلا" or matches[1]=="هلووو" then 

return   "هلُۆآتٌ حٍـيَـ{ლ}ـآتٌيَ┋✨😽💞"
 
elseif matches[1]=="السلام عليكم" or matches[1]=="السلام" or matches[1]=="سلام عليكم" or matches[1]=="سلام" then 

return  "ﯠعـہٰٰٰٖٖٖلہٰٰٰٖٖٖيکگہٰٰٰٖٖٖم ٵٴلہٰٰٰٖٖٖسہلہٰٰٰٖٖٖاٴمہٰٰٰٖٖٖہ┋😸✌️🏿"

elseif matches[1]=="الحمدلله" or matches[1]=="الحمد لله" or matches[1]=="تمام" or matches[1]=="زين" then 

return  "عہٰٰسہٰآهہٰآ دوٰ୭مہٰ ٰيہٰرہٰبہ┋😻💗"

elseif matches[1]=="مرحبا" then 

return  " مرُآحبٌ حٍـيَـ{ლ}ـآتٌيَ┆✨😽💞 " 

elseif matches[1]=="هاي" then 

return  "ۿّآيہٰآتہٰ يہٰـﮧٰروٰ୭حہٰـﮧٰي┋😻✌️🏿"

elseif matches[1]=="شلونكم" or matches[1]== "شخباركم" or matches[1]== "شلونك"or matches[1]== "شونك" then

return  "نــ͒͒ـٰ͒͢ــيـہ ⚉! دايح شہٰوفہٰ بقيـهہ ٵٴلآعـضَّـاء ┋🌝💔"

elseif matches[1]=="بوت " then 

return  "آٰسہٰمہٰـﮧٰيٰ سہٰمہٰآيہٰلہٰ┋🌝💗"

elseif matches[1]=="هلاو" then 

return   "هلُۆآتٌ حٍـيَـ{ლ}ـآتٌيَ┋✨😽💞"

elseif matches[1]=="اسكت" then 

return  "وکٰکٰٰيٰ💰☻م؏ـلمہ😽" 

elseif matches[1]=="🌚" then 

return  "ﻣنـﯛﺭ صہٰٰٰٖٖٖخہٰٰٰٖٖٖـٱمہٰٰٰٖٖٖہ الجہـدر ┆ 😹👐🏿 " 

elseif matches[1]=="زاحف" then 

return  "زٱٰٰٰٖٖٖحہٰٰٰٖٖٖحفہٰٰٰٖٖٖہ ۶ـہٰٰٰٖٖٖلہٰٰٰٖٖٖـﮯ خہٰٰٰٖٖٖخہـﮧٰٰٰ̯ٖٖٖ͡آٰٰٰٖٖٖلہٰٰٰٖٖٖتہٰٰٰٖٖٖکگ الہٰٰٰٖٖٖشہٰٰٰٖٖٖکگہٰٰٰٖٖٖرهہة┆🌝👐🏿" 

elseif matches[1]=="باي" then 

return  "الُلـ۬ـۧهۂ'ة✌🏿💗 פَيہّٰآكْہٰ حــہۛ💜ـياتيُـہ┋💗🚶🏿"

elseif matches[1]==" اكرهك" then 

return  "بہٰسہٰہٰ آنہٰتہٰيۙـﮯ آحہٰبہٰكگہ┋💜💁🏻♂"

elseif matches[1]=="تكرهني" then 

return  "طہبہعہآ مہٰـآ آگہٰرهہٰکہٰگہٰ ┋ 😹🌾"

elseif matches[1]=="حلو" then 

return  "نہٰٰٰٖٖٖتہٰٰٰٖٖٖہة ٰ،ֆ ٱٰٰٰٖٖٖلہٰٰٰٖٖٖآحہٰٰٰٖٖٖحہٰٰٰٖٖٖلہٰٰٰٖٖٖـْﮯ┋🙎🏾💗"

elseif matches[1]=="🤔"  then 

return  "لہٰيہٰروٰۨ੭حہٰ بہٰآلہٰگ بعيہٰد ┋ 🌝👐🏿"

elseif matches[1]=="اريد بوت" then 

return  " راسل المطـور وتدلل ¦😻 "

elseif matches[1]=="مح" or matches[1]== "محح" or matches[1]== "بوسه" or matches[1]== "بوسني" then

return  "محاتٖہ פــۛ💜ـياتيُـ┋🙊👄"

elseif matches[1]=="🙄"  or matches[1]== "🙄🙄"  then 

return  "دٱتشـوفہ الہٖيہٖـﮯ اشوفه┋🤔👐🏿"

elseif matches[1]=="😒"  or matches[1]== "😒😒"  or matches[1]== "😒😒😒" then 

return  "شٰٰٰٖٖٖبيہٰٰٰٖٖٖكہٰٰٰٖٖٖڪ!جہٰٰٰٖٖٖہ عہٰٰٰٖٖٖمہٰٰٰٖٖٖو┋✨🤔🍃"

elseif matches[1]=="🙈"  or matches[1]== "🙈🙈"  or matches[1]== "🙊"  or matches[1]== "🙊🙊" then 

return  "فہٰديہٰتہٰ آلہٰخہٰجہٰو୭لہ┋🙊👐🏿"

elseif matches[1]== "احبك"  or matches[1]== "تحبني" then

return   "مـۧـﯙ بــ̲̐س̯͡ہ احـبَـــك͡ۂ!جہٰٰٰٖٖٖہ مۛـ̲̐ـہوتنـﮯ۪۪۪۫۫۫ عـلـيہٰٰٰٖٖٖکگﮧ┋🙊🌸"
 
elseif matches[1]=="😞" or matches[1]== "☹️" or matches[1]== "☹️☹️" or matches[1]== "😔" or matches[1]== "😔😔" or matches[1]== "😔😔😔" or matches[1]== "" or matches[1]== "😔😔😔😔"  then

return   "شہٰبہٰبہٰيہٰـهـہ'ة لہٰحہٰلہٰيوٰ ضہٰٰآيج┋☹️💔"

elseif matches[1]=="هه" or matches[1]=="ههه" or matches[1]=="هههه" or matches[1]=="ههههه" or matches[1]=="هههههه" or matches[1]=="هههههه" or matches[1]=="😂" or matches[1]=="😂😂"or matches[1]=="😂😂😂" or matches[1]== "😂😂😂😂" or matches[1]== "😹"or matches[1]== "😹😹" or matches[1]== "😹😹😹" then

return  "دٰ୭مہٰ آلہٰٰٰٖٖٖضہٰٰٰٖٖٖحہٰٰٰٖٖٖـﮧٰٰٰٖٖٖكگہٰٰٰٖٖٖـههـہٰֆ💜┋😻✌️🏿"

elseif matches[1]=="😐" then 

return  "شہٰٰٰٖٖٖبـيہٰٰٰٖٖٖكہٰٰٰٖٖٖڪۂ😩👐🏿 صہٰٰٰٖٖٖـ̯افن┋😾🖕🏿"

elseif matches[1]=="غني" or matches[1]== "غنيلي" or matches[1]== "غنيي" then 

return  "عمي يبو البار 🤓☝🏿️ صبلي لبلبي ترى اني سكران 😌  وصاير عصبي 😠 انه وياج يم شامه 😉 وانه ويــــاج يم شامه  شد شد  👏🏿👏🏿 عدكم سطح وعدنه سطح 😁 نتغازل لحد الصبح 😉 انه وياج يم شامه 😍 وانه وياج فخريه وانه وياج حمديه 😂🖖🏿"

elseif matches[1]=="دي" then 

return  "دہٰيہٰيہٰآٰتہٰ لہٰ ـگ فہٰرخہٰ┋😾🖕🏿"

elseif matches[1]=="شغال" then 

return  "نہٰٰٰٖٖٖعمٰ عہٰٰٰٰٖٖٖزيہٰٰٰٖٖٖـزيٰ بٰٰٰٖٖٖآقٰٰٰٖٖٖيہٰٖ ﯢّآتٰٰٰٖٖٖمہٖـٰدد┋🌝✌️🏿"

elseif matches[1]=="💦" or matches[1]== "💦💦" or matches[1]== "💦💦💦" or matches[1]== "💦💦💦💦" or matches[1]== "تف عليك" or matches[1]== "تف" or matches[1]== "تتف"  then 

return  "مہٰٰٰٖٖٖيہٰٰٰٖٖٖيہٰٰٰٖٖٖہ﴿💗💧﴾ـﮯ ورﺩ̲ 🌸┋🙎🏾💔"

elseif matches[1]=="😍" or matches[1]== "😍😍" or matches[1]== "😍😍😍" or matches[1]== "😍😍😍😍" then 

return  "مۛہۛحۛہۛحۛہۛ  ♯💗"

elseif matches[1]=="بايات" then 

return  " مہٰٰٰٖٖٖالـہ دڕجہٰٰٰٖٖٖہ┋🙋🏿♂💗" 

else 

return   "نہٖعم حہٖحۘـﺒﻴۘﺒﻴـہۛ اہٖمہٖرني┋🌝💗"

end 

end 

return { 

  patterns = { 

"^(سمايل)$", 

"^(سلام)$",

"^(سلام عليكم)$",

"^(السلام)$",

"^(هلو)$", 

"^(هلوو)$",

"^(هلا)$",

"^(هلووو)$",

"^(زين)$",

"^(تمام)$",

"^(شخباركم)$",

"^(الحمدلله)$", 

"^(الحمد لله)$", 

"^(مرحبا)$", 

"^(هاي)$", 

"^(شلونكم)$", 

"^(بوت)$", 

"^(هلاو)$", 

"^(🌚)$", 

"^(🤔)$", 

"^(سلام)$", 

"^(زاحف)$", 

"^(باي)$", 

"^(اكرهك)$", 

"^(تكرهني)$", 

"^(اعشقك)$", 

"^(شخباركم)$", 

"^(اريد بوت)$", 

"^(مح)$",

"^(محح)$",

"^(بوسه)$",

"^(🙄)$",

"^(🙄🙄)$",

"^(اسكت)$",

"^(😒)$",

"^(😒😒)$",

"^(😒😒😒)$",

"^(🙈)$",

"^(🙈🙈)$",

"^(🙊)$",

"^(🙊🙊)$",

"^(😞)$",

"^(☹️)$",

"^(☹️☹️)$",

"^(😔)$",

"^(😔😔)$",

"^(😐)$",

"^(😔😔😔)$",

"^(هه)$",

"^(ههه)$",

"^(هههه)$",

"^(ههههه)$",

"^(هههههه)$",

"^(ههههههه)$",

"^(😂)$",

"^(😂😂)$",

"^(😂😂😂)$",

"^(😂😂😂😂)$",

"^(😹)$",

"^(😹😹)$",

"^(😹😹😹)$",

"^()$",

"^(غني)$",

"^(غنيلي)$",

"^(غنيي)$",

"^(دي)$",

"^(💦)$",

"^(💦💦)$",

"^(💦💦💦)$",

"^(💦💦💦💦)$",

"^(تف)$",

"^(تفف)$",

"^(تف عليك)$",

"^(😍)$",

"^(😍😍)$",

"^(😍😍😍)$",

"^(😍😍😍😍)$",

"^(شغال)$",

"^(حلو)$",

"^(بايات)$", 

    }, 

  run = run 

} 

end --By @iq_313k
--By @lxXx_56_xXxl
